#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "3fd9d8e246da48df265a2b56c6a6a214" -> "7f8192c62242df15230aca02262e3101"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "f98d32ef9e1e209a481def328949afc3" -> "cadf19a322641b494a12c64d409d9dde"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "11f935a16b96181b5f1d60b533a5244e" -> "137a45d9c49d8eca5cee46d6f1886024"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8dfbde83d9bf9635cc2193603b784e20" -> "0ed2b2773a3fb3bc970da6897272ac70"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "a59a67f4f6b68dc1f16dc51d4d190c73" -> "5c1c376013ca1ffadb5937c4669ffd1a"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "dfd74caf97dd029a0271a1d87e0a5334" -> "d1c5f31baab6d54eecbeab87bc0735f7"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "cbf1eec6057e6d8b46c230cd1e943655" -> "fdf9b395e265e0a9c85f78de86669aea"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "87752ff805b25a46eeb2bbc23a8838ca" -> "453866040efd95f1597b4f4d06bf8169"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f9a2e52a579c7b07c08a12e9a7265d2" -> "ead003df1f46e0106e56a927213e25a7"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f45863c38e435d983abec4a4d679a2a8" -> "bb465cd7ae619643c617df27895c23c9"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3f2109d6d262256255a07a6af1de532d" -> "088802e26ad0c000372b4aa8c13cbb1b"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "6e9f730a70967c6322be08b4426a76e1" -> "532e0715e8459053f5bfa6f36155d7db"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c167a9068e55f5c918a34a973de0a1ee" -> "9326959c443cc2180f2679dbfd090d1a"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "bec63d2b002c7a5d40a5f63854535c1b" -> "796bc9eedd43de02e78951fba98cafbf"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "c9bb8b943ba0395ac02e8af4007400bb" -> "e7bc7eab64c019afc2accf79a8866331"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "34a83bc43fc9bf85beff704b890b544b" -> "5b1629ae757b2ab5d797be87a00494ef"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f3c9c0f610f9b6930eca6932ac507fde" -> "aaf6799335fcdc6329dc483f5a612e29"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "95c0c6db0db31b750b5f63a71a1dc0da" -> "3fd75cd183a7513f16383275d3e7fefb"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "b85092f35e25bec659083eadbc29afed" -> "aca6fc0d3b7f26982ee1b0b501894f01"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f41897f87448f72dfe418df6dbbbb62c" -> "fc6adb4172be49677774cda786fcf20e"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "825ebda657d1f5f435b82b1df4bfb47c" -> "177fbb33f3dfc1013bfc1cbf905caac9"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "841a340e2969777842f6bcf9ae1909a6" -> "93131212018685d65fa74ce283d8089a"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "d4dc24a982673669115af458c04db206" -> "ca07b7892fea98e7063706fbeb617f60"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "64f56bb13e451ce4d349bccaf6a996e4" -> "d81d5d8a7c2409a93088196eca6547b3"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6850a38fab0a26a248459c42e76206ca" -> "dfed106f7646ce821a144f536f1b8781"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "0ed216389cc49084a9b9926be4cab436" -> "101ba7fe4231a0643dd9d9ed6b2c003d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a32a014813b70da72dc073aac79413cc" -> "e092b0b5af392db2a0e07dda7ff14184"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7e2a84615c2f77e3e20248495aba237a" -> "374c153b9562618971982cb09ffb9461"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "4d9002d1db480f54a67e19e3cf69aeec" -> "5b1602570f6bd22505152968cc9c20a8"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "048f2fa6c2eaebe03e456125336380da" -> "05578b6468599cae01bea8ce036c7940"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "942c10cc404adb0f22c8cc3fe44dc9bf" -> "180d8557c696f64f11d026b1d60a9bc2"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "97549c484694aa579fe8a864459cec7e" -> "7e7140ab1ebb3fe40d8099973d1d4891"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e2a5ec3983efa9ac1572e4032263dd77" -> "fd1c898a5b7dea30eceedd39470097ea"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6bcacef4498c40b184b74ccda2deaf22" -> "d45e3cc897e375185f7a2be17e787af6"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e88b19c2499f6ef1a97a722c66f83d42" -> "3dfd5af41a8c4489d409011510e9267b"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "d3fa3dd06a94784d79906f688d8c97a1" -> "a3eed5ed7b05757927e43d94141b03cd"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "26d5f2876d9575af3dfbe21efb3c6bfb" -> "92d1a4387fe44cf359f7b9e64231d328"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "394bfb21615993dbbae624a27baec5e4" -> "ec6679ab2c583a37260641c3bee2005d"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "eed8fd2ba6e0b0964f5468cd349864a1" -> "ed46c0f3d990a272d78d5628a346e54b"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "182e3a90e15667ab0466b3faa8180bf7" -> "c875afd5192f516fc975cbe27d5a3fd6"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "270478b4340359e7c2772c85809e55fe" -> "2202bf2e209cb8fb469e6db79300bd44"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "48f99cf2abe811a0a9146c5a4cd59618" -> "b9fbb6e0964c49945d5c4f0886cb82f5"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4779926d16b7cf2ef5ea6fc6f221d8a6" -> "cf66173939e176795bb8450a0b3cf377"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGr/mwjOLYX0LQRqh2gNgdS1rB+PQND0Jy15RpC+jc=" -> "El6LWps+J/gYoqmE48VT1jyyGfJuw1l2HyDC+XsI7Zg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vs7SjePrS8gY8XSNu+lYHctfGM5sAYDjKdHTRw5ufsM=" -> "b+wORQLs9eelAwLVJ5tEa+dHZhrThSt/aYcjLEFsFWc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcF1T8MPsERT7W10lMu5WTVx2BEqNfuIZVNoRwZkvhg=" -> "ruuVYABl4qUahaNbzLSK0IuUNFpGbpKBnMpIpgxN9/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6nGKT7DuSNL9X0QvZbGqL6061WKlPFxmqZPSqm3UQ0=" -> "b3kcRRJIFiMedSo/LU1eTTGw4arozrjWMtn11uDFAKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "gZn3mNzqb+Z2Ulnu/AaH0nd0QhDFANjFDuB3Wkk+SnA=" -> "QJIthf9j8+HfRy/Y3hsBa4DU1fGt0WFI07evVbTHlpA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "QBARFicV8aMsMejbusiB9tG4ss0eGJ33eT7u6h6oerc=" -> "YC/V0pZnPQYtUo7xLw7elcuXaWaxoe14o55SfQgkkK0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuVHQbNLqw5R0luyu2wMatebbGD8k41A4YiCLoGdIsU=" -> "8UdOLs4zugVNvU3wVE/4sdVF/lnDU4qVcF8t1pcGA0Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "RjbQ7qmaPGGxzia459HD/nhp6oKglMLdMxVRIiOZm1g=" -> "0hHG+8D9qks5jqYb0uH53Cc1vh/tu2AmlRedK54tk9M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUHMr65V/2Q7ICHoHVWmrmof2r2xrhDscnxG6GjboPs=" -> "ECdVCwSX2kzDmUUHjeBRkBHIBH3OTdMn0GQWGZ8ioJQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "/5+K7GTvHKWBGKLRKjQF+XA3DPHe6mqPH4lVOkk9Ai8=" -> "5/5DqEHTxarGDK5HSDZKopXo7I7HyNAZuGTKRzUZCQQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "s0s/xS64v+7MfGSHE8NBzVZELpRogJkYgW2Ly3SXaOY=" -> "KDGeG3OHqb5/Ym8oVefvyKpyRAeqc/tBOBhK0gw0pxM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WvvxCG2MBHXb58Qdjy3O+kB4eV67Dyn2nZAbG/dLjaU=" -> "/VGAv8KwJ/QlesnWAddwfMLzgDCVnjC/XmNTdVj/eKc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "WfSX6RJaW4ENU6xP/P/gpy4yRv6ospmLEqrdJxdxFZI=" -> "aABr7DlOqwexyn2/FCA2EjtyAo5V/FjGycyQUE+XWbo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "4AkT9JE2Xe+AMDnHrwdGCddqk9LO+yhLfETqOAqBFV0=" -> "wPA5CKfRWfugU+Y9eKyE/WWfoyWa28VG+/S//rdK6q0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "hMSKal/wJ1XwkUbECOGvT56THAbHdXqVO3g8n4ZxNVM=" -> "DpTz+JBkyJt/4k+fmtpU+tm8U2dB17hixqNKDZrXULE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEfGDPexcle4umaBCmkzzvwMPWE5Hxg4m7Ub8tpbM1k=" -> "D6xuXP15mg6zCO++dx2jZv5HZENNmLEnWoewpA9yHy8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hn9if487roM4UaqV+Atnyxi683F/qi/PC3PFLux90DU=" -> "STwPkI4kk85nMfORisfFTL6GWis6TU00py26IC79JA8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-01T20:43:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "CS/UZkEjhXDDR+YkZmTcn3k0NOLU6Ncp+IZUHMdCYkM=" -> "zKUTphSmhg5MWTZ+8jhfGBzU2fOZnSFbQOK8zuRd6vY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3Ccu5198aKGRv5n99K6tb51vB6VfGP6r4GPbsqBBhg8=" -> "jRIgIGwagppRa0uqNCREE17aj+bOfzMEbVCng8X9fOE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "iWRK/WvqG7zteJa3TGBaYf/6Uc/MJDjdONKMUW7UEVg=" -> "Puc6FvzcAcW97l6DwO+JzHVCc96dJ4sYJZDrwwhysKs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3DxJQse/usODcSM62/ng7/NDSTMAXSKE6t8EV84IG7A=" -> "9MWtf2vWoNhTq1VitoCkcQcPbY4CKo4KKvBI5jMbECQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "nIxmvcsGnEQj/3JikzTho5uvSolB1kgGHBr6vnkvRSk=" -> "WBLvQXZSlXblcLHJgSg6jqhwD1kc4opmJdzHzVQW7Gw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "o61Qn/k1HZpmwEXNfVxVVXZ9y5CNoH8+hND8nyR8xIc=" -> "RoLAV8QVsWpXv3kkHp0KTGyJuDtney0gGBaiqzeRXcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRg1n9vvr+qzEUyGMLU2DlRWURCVCHQPLLQgKVfefkQ=" -> "W5qKi4xp5RoUQMtFuEcPVecCSfjbebFpzfD9oVcJzjo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BxE/oLkR7+ssQWkKuoCZhyjdQj2zXHgXHce6vWwcv4k=" -> "NbNunM81u9++bYeCdlthjgmTnL1PVlWB0f69Qkx2mR0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "daKXo+d0SnGXXJELltf5+0KF9qu3Pi5xAJyVPrPpy0o=" -> "2R6Wd58eVtWQb2s3zjOfrynu2wewHnN3fm/2Hd6J4cg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVVP6bbzFbybG/b5c8xfc1Hz10S0mcAFDdybPn3SJU8=" -> "I21K3z6mD7W0yMI6yHiDU394IYrYSf5d+QMk55kOEnU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "FtFycq+75wH7WmejM0EfQg7UuSbTutqXJwsvBl+foKY=" -> "2JJt+ewHNwIJMi4A6p7a09xX2bNsMTfv810+c0CmebA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "DhVn4RBj9XpQ3oHcKcD+yYvhXpDQBRlIBGf2fxWChuY=" -> "QyFzgOG3lU0pdNwcCtmzf2HQCOVreae7UWZJ4Fzk+gI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "8jMpFs8EvfaQMhLwOp/nDbcjT5Bx//4ayLRX5ZpmI2I=" -> "gQnYbMhspcCraS71RU9s/0s1tx2heAkJUlBTHn5veh8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkSUJZg+ARrrCv1yFQ20VJk1pmcxOEb4UOuo3Hyyhc4=" -> "xyeoPYsqivwS4hRMr92QdGsLc0ba2a010/CM68TxWPc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gDKR3dicxdeoZRaod9aXDiIjmqpD9I2qxiQkn0H82MQ=" -> "TJNc7BlYXcgczIx3pcqVoExMMBT/QsfAMQraGMWUJM8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYWGtyI5Lqv3jrUzu/sr+7dWU8ZLr5/4KcXrgxV64Iw=" -> "u/t6L2ISgiGXn65bA1xlKFftcy/mw257HHqxupmiHxA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "e6eVu1PC03Kv1ti843nF7zO70gQSkgR0LE5s6g3azmU=" -> "DAuUiOi/ZXyQ8OAZEPZ6bVIJ2Kyl9Sur9xOj4qF2Pew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "luU1ZGPaN9Hf9KTPtentAC5C9f2eyqaA1kTiN7m9N1s=" -> "yVszaWSBI+YFuFRKXyHyFqVvoNeEN8pIoUkl7aFDuM4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "j1aYXpmP9J12jikw2d0hF3R4/CC+t42xQ/+spuvQXLI=" -> "eult0uXQMNZlsgGuXm2vR/bFrC2zBPtDUjEjELpjMhA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "lE5qhPbfP0aBmYZHtLGUszigfzXAWryafFEU6CZm8eo=" -> "b/vkF2NTSAsSFV/np+sbjtfGvBSPoPdnsTRBgfLByIE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "LCDdX0VpXrfCDv7lmh9iFHtr5/18DIrngpiNukwwv18=" -> "yrkuFgVQNSOyLFLup0QVzbroEwv0GA2EIEGxNy1p8Y8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RI9iFlD471X1/y3qRpSAHEBTEyTCyVFD9y7ucpdt+2I=" -> "grP1hNiQ29I1n7sY9gGOHMRor/OZGfXYTmGDRExTVps="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "j0CwaifjbZS5bozE7Bt01THRus6golSg3MrNam7at6I=" -> "0SGeTfMpyI4PS94OSaNMHZzg0J01LSfb19HD1dWLYr0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "gsZVR5KW35jFJMuJtHrW6fKkct6IQRmQNl/taBmM2LQ=" -> "yrStwjqaPvuVQ1rQkuMPdu08UPBnqGxXngYFHpygBAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "7MuPFDFN6Ic8GPoxF88DfO9O1To1XufVVd3FV55Ld8k=" -> "rhxYpI3y8K+4RfSiyapNIDtf1iRIIE+rQbH2t7PerQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-31T22:46:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xy4ll8" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-31T22:46:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-31T22:49:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 87 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*